"""6. Зайдіть на сайт Project Gutenberg’s( https://www.gutenberg.org/ ) і знайдіть кілька книг для аналізу. \
    Завантажте текстові файли цих творів або скопіюйте текст з браузера у текстовий файл на вашому комп’ютері. \
    Напишіть програму, яка зчитує дані з файла і визначає кількість входжень слова 'the' в кожному тексті \
    незалежно від регістру. Для підрахунку кількості входжень слова або виразу в рядок \
    можна скористатися функцією count()"""

with open('c:\Merck\Python\Chapter8\\gutt.txt', 'r', encoding='utf8') as file1:
    text = file1.read()

c = text.count('the') + text.count('The')
print(c)
