"""5. Створіть порожній файл guest_book.txt у текстовому редакторі. Напишіть цикл while, \
    який запитує у користувачів імена. При введенні кожного імені виведіть на екран рядок \
    з вітанням для користувача і запишіть рядок вітання у файл з ім’ям guest_book.txt. \
    Простежте за тим, щоб кожне повідомлення розміщувалося в окремому рядку файла. Передбачте вихід з циклу"""

with open('c:\Merck\Python\Chapter8\\guest_book.txt', 'a', encoding='utf8') as file1:
    while True:
        name = input("Введіть ім'я(q для виходу)")
        if name == 'q': exit()
        hello = "Привіт, " + name + ', вітаю!'
        print(hello)
        file1.write(hello + '\n')
