# написати программу яка рахує кількість щасливих білетів
#
# білет містить 6 цифр
# білет є щасливим коли сума перших трьох цифр дорівнює сумі другої трійки цифр
# наприклад
# 101020 - щасливий бо
# 1+0+1 == 0 + 2 + 0
#
# 546021 - звичайний, бо
# 5+4+6 != 0 + 2 + 1
#
# передбачити що можуть бути і номера накшталт
# 000012
# 001099
#
# Бажано щоб функція могла підтримувати розпаралелювання (приймати на вхід початок і кінець діапазону для обрахунку)

def lucky_ticket(start, end):
    count = 0
    for number in range(start, end):
        lst = [int(x) for x in str(number)]
        while len(lst) < 6:
            lst.append(0)
        if lst[0]+lst[1]+lst[2] == lst[3]+lst[4]+lst[5]:
            # print(f'{number} is a lucky ticket')
            count += 1
    print(f'Number of lucky tickets: {count}')


if __name__ == '__main__':
    lucky_ticket(1, 999999)
