"""8. Виконайте перетворення значення температури у градусах Цельсія (C)
 для інших температурних шкал: Фаренгейта (F) і Кельвіна (K). 
 Програма повинна відображати еквівалентну температуру у градусах 
 Фаренгейта (F = 32 + 9/5 * C). Програма повинна відображати 
 еквівалентну температуру у градусах Кельвіна (K = C + 273,15). 
 Результати потрібно вивести на екран у відформатованому вигляді: 
 з використанням двох знаків після десяткової крапки, 
 мінімальною довжиною поля (15), вирівнюванням по центру. 
 Зверніть увагу, у дійсних числах для розділення дробової 
 і цілої частин використовують крапку"""
C = float(input("Введіть градуси Цельсію: "))
F = 32 + 9/5 * C
F = '{0:.2f}'.format( float(F) )
K = C + 273.15
K = '{0:.2f}'.format( float(K) )
print("Celsius: " + '{0:.2f}'.format(float(C)).center(15))
print("Farenheit: " + F.center(15))
print("Kelvin: " + K.center(15))
