"""6. Виконайте переведення одиниць вимірювання відстаней. 
Значення відстані вказано у метрах. У кожному новому рядку програма 
виводить значення відстані, представлене у: дюймах, футах, милях, ярдах тощо. 
Числові дані на екрані мають бути у відформатованому вигляді: 
два знаки після десяткової крапки. Використайте функцію format(). 
Потрібні значення одиниць вимірювання знайдіть у мережі Інтернет."""
meter = int(input("Введіть кількість метрів: "))
print("Input meters: " + str(meter) + "m")
print("Feets: " + '{0:.2f}'.format( float(meter/0.3048) ) )
print("Inches: " + '{0:.2f}'.format( float(meter/0.0254) ) )
print("Miles: " + '{0:.2f}'.format( float(meter/1609.344) ) )

