"""За координатами широти і довготи двох точок на Землі у градусах визначте відстань між ними 
у кілометрах. Нехай (x1, y1) і (x2, y2) є кординатами широти і довготи (у градусах) 
двох точок на земній поверхні. Відстань між цими точками у кілометрах обчислюється так: 
6371.032 × arccos(sin(x1) × sin(x2) + cos(x1) × cos(x2) × cos(y1 - y2)). 
Значення 6371,032 - це середній радіус Землі у кілометрах. 
Тригонометричні функції Python працюють з радіанами. Як результат, 
необхідно перетворити значення координат із градусів у радіани перед обчисленням 
відстані за формулою. Модуль math містить функцію з ім’ям radians(), 
яка переводить градуси у радіани. Переведення можна зробити і за формулою, 
на зразок x1 = x1 × pi/180, де pi - число Пі. Знайдіть відстань між двома містами 
Пекін (39.9075000, 116.3972300) і Київ (50.4546600, 30.5238000) і виведіть значення на екран. 
Значення відстані повинне відображатися у відформатованому вигляді: 
з використанням трьох знаків після десяткової крапки, мінімальною довжиною поля (10), 
вирівнюванням за правим краєм. На даному сайті( https://dateandtime.info/uk/ ) знайдіть 
значення координат у десяткових градусах ще для кількох пар міст на вибір і визначте відстань 
у кілометрах між ними. Перевірте правильність визначення відстаней між містами, 
використовуючи один із сервісів вищезгаданого сайту"""


import math

def to_rad(x):
    return x * math.pi / 180

Beijing = [ 39.5426 , 116.2350 ]
Kyiv = [ 50.2716 , 30.3125 ]
#x1 = 39.9075000
#y1 = 116.2372300
#x2 = 50.4546600
#y2 = 30.5238000
radius = float(6371.032)

x1 = to_rad(Beijing[0])
y1 = to_rad(Beijing[1])
x2 = to_rad(Kyiv[0])
y2 = to_rad(Kyiv[1])

distance = radius * math.acos(math.sin(x1) * math.sin(x2) + math.cos(x1) * \
    math.cos(x2) * math.cos(y1 - y2))
#print(distance)
distance = float('{0:.3f}'.format(distance))
print('{0:>10f}'.format(distance))