"""11. Створіть програму, яка зчитує позицію шахової фігури від користувача і повідомляє про колір квадрату, \
де знаходиться фігура. Наприклад, якщо користувач вводить a і 1, то програма повинна повідомити, \
що квадрат має колір black, якщо d і 5 - програма повідомляє, що квадрат має колір white"""

st = {'a':1, 'b':2, 'c':3, 'd':4, 'e':5, 'f':6, 'g':7, 'h':8}

while True:
    x = input('Введіть вертикаль(число 1-8): ')
    if not x.isnumeric():
        print('Це не число!')
        continue
    x = int(x)
    y = input('Введіть горизонталь(буква a-h): ')
    if not y.isalpha(): 
        print('Це не буква!')
        continue
    if x == 0 or y == 'q': 
        exit()
    y = st[y]
    
    if not (x*y)%2:
        print('white')
    else:
        print('black')
