
"""6. Потрібно визначити, чи є даний рік високосним. Нагадаємо, що високосними роками вважаються ті роки, \
порядковий номер яких або кратний 4, але при цьому не кратний 100, або кратний 400 \
(наприклад, 2000-й рік був високосним, а 2100-й буде невисокосним роком). \
Програма повинна коректно працювати на числах від 1900 до 3000 років. Виведіть Leap year. у разі, \
якщо рік є високосним і Ordinary year. у протилежному випадку"""

while True:
    i = input('Введіть рік(q для виходу):')
    if i == 'q': 
        exit()
    elif not i.isnumeric():
        print('Not number!')
    elif (int(i)%4 == 0 and int(i)%100 != 0) or (int(i)%4 == 0 and int(i)%400 == 0):
        print('Leap year')
    else:
        print('Ordinary year')