
"""8. Зчитайте цілі числа, які вводить користувач, по одному числу у рядку. Для кожного введеного числа \
виконайте перевірку: якщо число менше 10, то пропускаємо це число, якщо число більше 100, \
то припиняємо зчитувати числа. У інших випадках вивести це число в окремому рядку"""

lst = []
while True:
    i = input('Введіть число(Більше 100 для виходу):')
    if not i.isnumeric():
        print('Not number!')
    elif int(i) < 10:
        pass
    elif int(i) <=100:
        i = int(i)
        lst.append(i)
    else:
        break

for i in lst:
    print(i)
