
"""3. Порядкові числівники у англійській мові закінчуються суфіксом th (окрім 1st, 2nd і 3rd). \
Cтворіть список чисел від 1 до 9. Використайте ланцюжок if-elif-else у циклі для виведення \
правильного закінчення числівника для кожного числа. Програма повинна виводити числівники \
1st 2nd 3rd 4th 5th 6th 7th 8th 9th, кожен у новому рядку"""

for i in range(1, 10):
    print(i, end='  ')
    if i == 1:
        print(f'{i}st')
    elif i == 2:
        print(f'{i}nd')
    elif i == 3:
        print(f'{i}rd')
    else:
        print(f'{i}th')
