"""2. Виведіть інформацію про однопіксельний прозорий GIF-файл. \
Використайте функцію unhexlify() для того, щоб перетворити \
шістнадцятковий рядок у змінну типу bytes з ім’ям gif. Байти, \
що містяться у змінній gif, визначають однопіксельний прозорий GIF-файл. \
Коректний файл формату GIF починається з рядка GIF89a. Чи є цей файл \
коректним? Ширина файла формату GIF є шістнадцятибітним цілим числом \
з прямим порядком байтів (little-endian, специфікація GIF ), яке \
починається зі зсуву 6 байт. Його висота має такий же розмір і починається \
зі зсуву 8 байт. Отримайте і виведіть на екран ці значення \
для змінної gif. Чи рівні вони 1?"""

import binascii
line = '47494638396101000100800000000000ffffff21f90401000000002c000000000100010000020144003b'
gif = binascii.unhexlify(line)
print(gif)
if gif[:6] == b"GIF89a":
    width = binascii.hexlify(gif[7:8])
    height = binascii.hexlify(gif[9:10])
    print(int(width, 16), int(height, 16))
else:
    print('Incorrect GIF header')

